Autodesk.Revit.DB.MassDisplayTemporaryOverrideType
This enum identifies the mass display overrides.
Since:
2012
Since:
2012

Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassZonesAndShades
Mass zone and mass shade subcategories will be displayed.

Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassSurfaceTypes
Mass energy analysis surface subcategories (and Mass Floors) will be displayed.

Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassFormAndFloors
Mass form and mass floor subcategories will be displayed in all views.

Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassByViewSettings
Mass will be displayed in each view based on the visibility settings of that view.